# Group By

<img src="Groupy.png" height= 500px width= 600px>

### Course's Examples

In [3]:
import pandas as pd
import numpy as np

In [5]:
data = {'Company':
       ['GOOGLE','GOOGLE','FACEBOOK','FACEBOOK','AMAZON','AMAZON','AMAZON'],
        'Person':
       ['BAA','Aayush','Sameer','Heena','Mitesh','Bhavya','Babu'],
       'Sales':
       [1000,20000,20,4320,1110,2340,4440]}

df = pd.DataFrame(data)
df

    Company  Person  Sales
0    GOOGLE     BAA   1000
1    GOOGLE  Aayush  20000
2  FACEBOOK  Sameer     20
3  FACEBOOK   Heena   4320
4    AMAZON  Mitesh   1110
5    AMAZON  Bhavya   2340
6    AMAZON    Babu   4440

#### Groupby Company

In [7]:
df.groupby('Company')

In [8]:
Grouped = df.groupby('Company')

In [22]:
Grouped.mean()                        # Doesn't return the Person col as that can't be mean.

          Sales
Company
AMAZON     2630
FACEBOOK   2170
GOOGLE    10500

In [24]:
Grouped.min()                        # Here comparing names is possible

          Person  Sales
Company
AMAZON      Babu   1110
FACEBOOK   Heena     20
GOOGLE    Aayush   1000

In [18]:
Grouped.min().columns.names = ['Category']

In [21]:
Grouped.min() = Grouped.min().columns.names = ['Category']

SyntaxError: cannot assign to function call (<ipython-input-21-0809371dd06e>, line 1)

# #Ask Grass

How to assign name to the column...? It is on the air... how to store?  ✓
(Didn't ask but done)

# #Ask Grass

How to access column after doing a groupby? ✓  (Solved by me)  

    >>>   salaryData.groupby('Year').mean()  <--- Here I have to calculate all mean then I can select.
                                                  what if I want to select only one perticular year's
                                                  column and then perform mean() ?
                                                  

```python
df[df['Company'].isin(['GOOGLE', 'FACEBOOK'])].groupby(['Company', 'Person']).mean()
```

_

### Continuing...

In [25]:
df

    Company  Person  Sales
0    GOOGLE     BAA   1000
1    GOOGLE  Aayush  20000
2  FACEBOOK  Sameer     20
3  FACEBOOK   Heena   4320
4    AMAZON  Mitesh   1110
5    AMAZON  Bhavya   2340
6    AMAZON    Babu   4440

In [27]:
Grouped.describe()

         Sales                                                           \
         count     mean           std     min     25%      50%      75%
Company
AMAZON     3.0   2630.0   1683.834909  1110.0  1725.0   2340.0   3390.0
FACEBOOK   2.0   2170.0   3040.559159    20.0  1095.0   2170.0   3245.0
GOOGLE     2.0  10500.0  13435.028843  1000.0  5750.0  10500.0  15250.0


              max
Company
AMAZON     4440.0
FACEBOOK   4320.0
GOOGLE    20000.0

In [29]:
Grouped.describe().transpose()

Company           AMAZON     FACEBOOK        GOOGLE
Sales count     3.000000     2.000000      2.000000
      mean   2630.000000  2170.000000  10500.000000
      std    1683.834909  3040.559159  13435.028843
      min    1110.000000    20.000000   1000.000000
      25%    1725.000000  1095.000000   5750.000000
      50%    2340.000000  2170.000000  10500.000000
      75%    3390.000000  3245.000000  15250.000000
      max    4440.000000  4320.000000  20000.000000

In [31]:
Grouped.describe().transpose()['GOOGLE']

Sales  count        2.000000
       mean     10500.000000
       std      13435.028843
       min       1000.000000
       25%       5750.000000
       50%      10500.000000
       75%      15250.000000
       max      20000.000000
Name: GOOGLE, dtype: float64

###

###

###  My trials

In [32]:
data = {'Company':
       ['GOOGLE','GOOGLE','FACEBOOK','FACEBOOK','AMAZON','AMAZON','AMAZON'],
        'Person':
       ['BAA','Aayush','Sameer','Heena','Mitesh','Aayush','Babu'],
       'Sales':
       [1000,20000,20,4320,1110,2340,4440]}

df = pd.DataFrame(data)
df

    Company  Person  Sales
0    GOOGLE     BAA   1000
1    GOOGLE  Aayush  20000
2  FACEBOOK  Sameer     20
3  FACEBOOK   Heena   4320
4    AMAZON  Mitesh   1110
5    AMAZON  Aayush   2340
6    AMAZON    Babu   4440

In [36]:
df.groupby('Person').min()

         Company  Sales
Person
Aayush    AMAZON   2340
BAA       GOOGLE   1000
Babu      AMAZON   4440
Heena   FACEBOOK   4320
Mitesh    AMAZON   1110
Sameer  FACEBOOK     20

##### Not interesting test, you may skip my trials!